SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
  /* ---------------------------------------------------------------
     Step 5: Capture CALLBACK_FRAMES — pipe keeps running continuously,
     NO Stop/Restart and NO mini-warmup frames needed at all. Each
     completed frame lives in raw_buf[(frame_seq-1) % 2]; we just copy
     it out before DCMIPP cycles back to that same buffer 2 frames later.
     --------------------------------------------------------------- */
  PERF_MARK(g_perf_timer, CAM_SNAP);
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Capturing %d frames (continuous, double-buffer copy)...\n", CALLBACK_FRAMES);
#endif

  for (uint8_t i = 0; i < CALLBACK_FRAMES; i++) {
    uint32_t frame_ms = 0;

    /* Wait for the frame event callback (ISR-driven, precise). */
    if (CAM_WaitNextFrameReady(120, &frame_ms) != 0) {
#if PERF_DEBUG_LEVEL >= 1
      printf("[CAM] Frame wait timeout at index %u\n", (unsigned)i);
#endif
      break;
    }
    frame_seq++;

    /* Copy the buffer that JUST finished — DCMIPP is now writing the
       OTHER buffer, so this one is safe for a full frame period. */
    uint8_t *src = raw_buf[(frame_seq - 1U) % 2U];
    uint8_t *dest = batch_buf + (i * frame_size);
    SCB_InvalidateDCache_by_Addr((uint32_t*)src, frame_size);
    memcpy(dest, src, frame_size);
    SCB_CleanDCache_by_Addr((uint32_t*)dest, frame_size);
    captured++;

#if PERF_DEBUG_LEVEL >= 2
    printf("[CAM] capture[%u] frame in %lu ms (no restart)\n",
           (unsigned)captured, (unsigned long)frame_ms);
#endif
  }

  /* ---------------------------------------------------------------
     Step 6: Stop pipe ONCE after ALL frames captured.
     --------------------------------------------------------------- */
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Callback-Batch: %d/%d frames in %lu ms (continuous, no restart)\n",
         (unsigned)captured, CALLBACK_FRAMES, (unsigned long)(HAL_GetTick() - t0));
#endif

callback_exit:
  /* Return to standby. */
  PERF_MARK(g_perf_timer, CAM_STOP);
  HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
  CAM_WriteSensorReg(IMX335_REG_MODE_SELECT, IMX335_MODE_STANDBY);
  PERF_MARK(g_perf_timer, CAM_DEINIT);
  return (int)captured;
}

int CAM_IsCallbackReady(void)
{
  return g_callback_ready;
}
